0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform  7.3006e-05;

boundaryField
{
    my-velocity-inlet
    {
        type		fixedValue;
	value		$internalField;
	//type            zeroGradient;
	//type		calculated;
	//value		uniform 1e-12;
    }

    my-pressure-outlet
    {
        type            zeroGradient;
	//type            calculated;
        //value           uniform 1e-12;
    }

    my-wall
    {
        //type            zeroGradient;
        type            fixedValue;
	value		uniform 1e-12;
    }

    "(backPlanes|frontPlanes)"  //"(wedgeplanesFront|wedgeplanesBack)"
    {
        type            empty;
    }

    symmetry
    {
        type            slip;
    }

    freeSurf
    {
        type            zeroGradient; //calculated;
	//value		uniform 0.;
    }
}

// ************************************************************************* //
